Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/introduction_to_the_irish_system/health_care_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Public health care for people coming to Ireland
ga: Cúram sláinte phoiblí do dhaoine a thagann go hÉirinn

source: If you are a national of the European Economic Area (EEA) or Switzerland, or if you are normally resident in Ireland, you are entitled to receive the same level of health care as Irish citizens
ga: Más saoránach de cheann de bhallstáit an LEE tú nó den Eilvéis, nó má tá gnáthchónaí ort in Éirinn, tá tú i dteideal an leibhéil chéanna cúram sláinte atá ar fáil do shaoránaigh Éireannacha

source: Depending on your income, you may be eligible for a medical card, which entitles you to the full range of medical services at no cost
ga: Ag brath ar d'ioncam, d'fhéadfadh sé go mbeadh tú i dteideal cárta leighis a chuireann an réimse iomlán seirbhísí leighis ar fáil duit saor in aisce

source: If you are not from an EEA member state or Switzerland, you will be entitled to certain services free of charge and you will have to pay for the remainder
ga: Más saoránach neamh-LEE tú beidh tú ina theideal cuid de na seirbhísí a fháil in aisce agus beidh ort íoc as an gcuid eile

source: If you are coming to live, work, study or retire in Ireland you can find out more information on eligibility for public health services
ga: Má tá tú ag teacht chun cónaí, oibriú, staidéir nó ar phinsean go hÉirinn is féidir tuilleadh eolais a fháil maidir le bheith i dteideal seirbhísí leighis phoiblí anseo

source: If you are coming to Ireland on holiday or on a short stay (for example, on business), you can read more information on health services for visitors to Ireland
ga: Más ar saoire atá tú in Éirinn nó ar chuairt ghairid (mar shampla, ar ghnó) is féidir tuilleadh eolais a fháil ar sheirbhísí leighis do chuairteoirí anseo

source: Private health care for people coming to Ireland
ga: Cúram sláinte phríobháideach do dhaoine a thagann go hÉirinn

source: In addition to the public health system, people in Ireland can avail of a range of private health care services
ga: Sa bhreis ar an gcóras sláinte phoiblí is féidir le daoine in Éirinn teacht ar réimse leathan seirbhísí leighis phríobháideacha

source: You must pay the full costs of treatment if you opt for private health care
ga: Má roghnaíonn tú cúram sláinte phríobháideach beidh ort íoc as an gcúram ina iomlán

source: There are a number of private health insurance companies in Ireland. Providers include VHI Healthcare, Laya Healthcare, Irish Life Health and HSF Health Plan (does not provide cover for hospital in-patient costs)
ga: Tá líon chomhlacht a chuireann árachas sláinte phríobháideach ar fáil in Éirinn - VHI, Laya Healthcare, Irish Life Health agus HSF Health Plan (níl aon chumhdach costais ospidéil d'othair chónaitheach)

source: As long as you are from the EEA or Switzerland or normally resident in Ireland, you are entitled to the same benefits from your private health insurance with any of these companies as any other Irish citizen
ga: Más saoránach den LEE nó den Eilvéis thú nó má tá gnáthchónaí ort in Éirinn tá tú i dteideal na sochar céanna ó cheachtar den dá chomhlacht árachais sláinte phríobháideach seo agus a fhaigheann saoránach ar bith Éireannach eile

source: Since 16 October 2013, up to €1,000 for adults and €500 for children of your private health insurance premium attracts tax relief at the standard rate (20%)
ga: Tá faoiseamh cánach ag an ngnáthráta (20%) ar fáil ar an táille a íocann tú ar árachas sláinte príobháideach, suas go €1,000 do dhaoine fásta agus €500 do leanaí

source: This tax relief is deducted at source by the health insurance provider
ga: Cuireann an comhlacht árachais an faoiseamh cánach ar fáil iad féin
